{
  "main": {
    "name": "Vraj Patel",
    "occupation": "Full Stack Developer",
    "description": "I work on every part of the stack",
    "image": "profilepic.jpg",
    "bio": "As a Full Stack Developer with over six years of experience and a Master's degree in Computer Science, I specialize in Java, Spring Boot, ReactJs, and AWS. I have a proven track record of developing sophisticated web applications and large-scale software solutions for high-profile clients, coupled with leading small teams in project modules. I am dedicated to delivering innovative and efficient software solutions.",
    "contactmessage": "Get in touch with me for any working opportunities.",
    "email": "patel.vraj7255@gmail.com",
    "phone": "+1 (778) 955-2844",
    "address": {
      "street": "",
      "city": "Vancouver",
      "state": "British Columbia,Canada",
      "zip": ""
    },
    "resumedownload": "https://drive.usercontent.google.com/download?id=1i7TAvyHdEEQIdfPPhCTY2tPwVC4Wve-I&export=download&authuser=0&confirm=t&uuid=3bf2a398-9652-4604-b14f-8fcff9e4a13d&at=APZUnTUl2vy4O1H3h1W5k_2BiRrk:1705474171822",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/vrajpatel3010",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/VrajPatel-3010",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Conceptual & Language Proficiency",
    "education": [
      {
        "school": "Fairleigh Dickinson University",
        "degree": "Master's of Science in Computer Science",
        "graduated": "April 2024",
        "description": "Graduated with Distinction (3.8/4.0)"
      },{
        "school": "Charotar University of Science and Technology",
        "degree": "Bachelor's in Information and Technology",
        "graduated": "May 2018",
        "description": "Graduated with Distinction (8.4/10.0)"
      }
    ],
    "work": [
      {
        "company": "SPLENDID IT SOLUTIONS",
        "title": "SENIOR SOFTWARE ENGINEER",
        "years": "March 2023 - Present",
        "description": "Developed a web application with NFC card integration using Java Spring Boot (used JWT Token) and React with MYSQL database, deployed on AWS (EC2 and RDS), reducing system latency by 40% (from 200ms to 120ms). Enabled users to configure landing pages/portfolios via NFC cards and automated email notifications with AWS Lambda, increasing user registrations by 500 and reducing manual notifications by 50%.Integrated REST API (Google Cloud API) for real-time location tracking and third-party payment processing, reducing transaction time from 5 seconds to 3.75 seconds and improving code management with Git for 50 successful deployments. Configured HTTP/TCP routing and Nginx for load balancing, increasing scalability to handle 1,000 concurrent users, and implemented SSL certification, reducing security incidents by 40% on Linux system"
      },
      {
        "company": "TATA CONSULTANCY SERVICES (TCS)",
        "title": "SOFTWARE ENGINEER",
        "years": "January 2020 - January 2023",
        "description": "Designed a cloud-native website according to client specifications using React, Ajax, jQuery, SCSS/Bootstrap for the front end, and Java Spring Framework for the back end with MYSQL database. Converted a 1,600-page static rulebook into a dynamic single-page module using database designs and K-means clustering, resulting in a 70% reduction in page load times and improved data handling. Integrated AWS S3 for file uploads/downloads and implemented payment gateway integration and authentication with Android’s REST APIs, streamlining transaction processes and improving security"
      },
      {
        "company": "TATA CONSULTANCY SERVICES (TCS)",
        "title": "SOFTWARE ENGINEER",
        "years": "June 2018 - January 2020",
        "description": "Migrated a static Java backend to a dynamic Java Spring backend, utilizing JSON for data transfer, and established a CI/CD pipeline for automated deployment on Jenkins, reducing deployment time by 25%. Integrated digital and manual government forms into a unified dashboard, streamlining document management and data retrieval for municipal services"
      },
      {
        "company": "TATA CONSULTANCY SERVICES (TCS)",
        "title": "ASSOCIATE SYSTEM ENGINEER INTERN ",
        "years": "January 2018 - April 2018",
        "description": "Designed and optimized RESTful APIs, improving data efficiency between front-end and back-end by 35%. Conducted unit testing using JUnit for Java applications, improving code quality and reducing defects by 15% across multiple projects. Guided users through the SDLC phases, from system implementation to ongoing maintenance, ensuring effective adoption"
      },
      {
        "company": "DI SOLUTIONS",
        "title": "SOFTWARE ENGINEER INTERN",
        "years": "April 2017 - June 2017",
        "description": "Developed PHP webpages for a WordPress website.Contributed towards requirement gathering from customers."
      }
    ],
    "skills": [
      {
        "name": "JAVA",
        "level": "100%"
      },
      {
        "name": " SPRING BOOT",
        "level": "100%"
      },
      {
        "name": "ReactJs",
        "level": "90%"
      },
      {
        "name": "JavaScript",
        "level": "100%"
      },
      {
        "name": "AWS",
        "level": "90%"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I had the pleasure of collaborating with Vraj Patel, and I can confidently say that their expertise and dedication were invaluable. Vraj consistently demonstrated a strong work ethic, exceptional problem-solving skills, and a collaborative spirit. Their ability to think creatively and drive results significantly contributed to our project's success. I highly recommend Vraj for any future endeavors.",
        "user": "Riddhi Patel, Data Engineer at Anblicks"
      },
      {
        "text": "Vraj Patel has an impressive ability to troubleshoot complex issues and implement innovative solutions, ensuring that our projects are delivered on time and exceed expectations.",
        "user": "Okery Liu, Blockchain | Event | Gold Concentrate Procurement"
      },
      {
        "text": "I had the pleasure of working with Vraj at TCS, where he was an excellent full stack developer. He has deep knowledge of Java and Spring Boot, and his skills were crucial in our DGCA project. Vraj's experience with AWS services made our project run smoothly and efficiently. He is great at integrating different technologies and creating high-quality applications. Vraj is not only technically skilled but also a great team player. He is dedicated, solves problems quickly, and always goes the extra mile. His hard work and innovative ideas were a big asset to our team. I highly recommend Vraj for any role that requires expertise in Java, Spring Boot, and AWS. He will be a valuable addition to any team.",
        "user": "Manoj Shah, Senior Software Engineer at Cognizant"
      }
    ]
  }
}
