{
  "main": {
    "name": "Vraj Patel",
    "occupation": "Full Stack Developer",
    "description": "I work on every part of the stack",
    "image": "profilepic.jpg",
    "bio": "As a Full Stack Developer with over six years of experience and a Master's degree in Computer Science, I specialize in Java, Spring Boot, ReactJs, and AWS. I have a proven track record of developing sophisticated web applications and large-scale software solutions for high-profile clients, coupled with leading small teams in project modules. I am dedicated to delivering innovative and efficient software solutions.",
    "contactmessage": "Get in touch with me for any working opportunities.",
    "email": "patel.vraj7255@gmail.com",
    "phone": "+1 (778) 955-2844",
    "address": {
      "street": "",
      "city": "Vancouver,",
      "state": "British Columbia",
      "zip": ""
    },
    "resumedownload": "https://drive.usercontent.google.com/download?id=1i7TAvyHdEEQIdfPPhCTY2tPwVC4Wve-I&export=download&authuser=0&confirm=t&uuid=3bf2a398-9652-4604-b14f-8fcff9e4a13d&at=APZUnTUl2vy4O1H3h1W5k_2BiRrk:1705474171822",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/vrajpatel3010",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/VrajPatel-3010",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Conceptual & Language Proficiency",
    "education": [
      {
        "school": "Fairleigh Dickinson University",
        "degree": "Master's of Science in Computer Science",
        "graduated": "April 2024",
        "description": "Graduated with Distinction(3.8/4.0)"
      },{
        "school": "Charotar University of Science and Technology",
        "degree": "Bachelor's in Information and Technology",
        "graduated": "May 2018",
        "description": "Graduated with Distinction(8.4/10.0)"
      }
    ],
    "work": [
      {
        "company": "SPLENDID IT SOLUTIONS",
        "title": "Full Stack Developer",
        "years": "March 2023 - Present",
        "description": "Implemented a microservices architecture for an NFC card integrated web application using Java Spring Boot and React Native at Splendid IT Solutions. Deployed on GCP, enhancing system scalability and fault tolerance Created e-commerce/dynamic websites for smaller businesses using PHP or JAVA backedIntegrated REST API (Google Cloud API) to fetch the current accurate location of Employees with a clock in/ clock out feature and implemented third-party PAYMENT integration to streamline transactions also used Git for version control and collaboration within the team Utilized Docker for containerization, improving development and deployment processesConfigured HTTP/TCP routing and Nginx for web application load balancing and traffic management. Implemented SSL certification for website security, enhancing data protection and user trust"
      },
      {
        "company": "TATA CONSULTANCY SERVICES (TCS)",
        "title": "Full Stack Engineer/IT Analyst",
        "years": "January 2020 - January 2023",
        "description": "Developed a cloud-native platform using React for the Directorate General of Civil Aviation. Designed a modular architecture for a cloud-native platform using React and Spring boot at Tata Consultancy Services. Converted a 1600 static page rulebook into a dynamic single-page application, employing MVC design pattern and K-means clustering for scalable and maintainable system architecture"
      },
      {
        "company": "TATA CONSULTANCY SERVICES (TCS)",
        "title": "System Engineer",
        "years": "June 2018 - January 2020",
        "description": "Ported static Java backend code to a dynamic Java Spring backend.Created a database that connected both digital and manual government forms using Hibernate.Provided support for bugs and issues post deployment."
      },
      {
        "company": "TATA CONSULTANCY SERVICES (TCS)",
        "title": "Associate System Engineer Intern",
        "years": "January 2018 - April 2018",
        "description": "Developed digital tax forms and debugged production issues.Provided on-site support at Nagapalika (City Council) and assisted officers with the new developed system."
      },
      {
        "company": "DI SOLUTIONS",
        "title": "Software Engineer Intern",
        "years": "April 2017 - June 2017",
        "description": "Developed PHP webpages for a WordPress website.Contributed towards requirement gathering from customers."
      }
    ],
    "skills": [
      {
        "name": "JAVA",
        "level": "100%"
      },
      {
        "name": " SPRING BOOT",
        "level": "100%"
      },
      {
        "name": "ReactJs",
        "level": "90%"
      },
      {
        "name": "JavaScript",
        "level": "100%"
      },
      {
        "name": "AWS",
        "level": "90%"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I had the pleasure of collaborating with Vraj Patel, and I can confidently say that their expertise and dedication were invaluable. Vraj consistently demonstrated a strong work ethic, exceptional problem-solving skills, and a collaborative spirit. Their ability to think creatively and drive results significantly contributed to our project's success. I highly recommend Vraj for any future endeavors.",
        "user": "Data Engineer at Anblicks"
      },
      {
        "text": "Vraj Patel has an impressive ability to troubleshoot complex issues and implement innovative solutions, ensuring that our projects are delivered on time and exceed expectations.",
        "user": "Okery Liu, Blockchain | Event | Gold Concentrate Procurement"
      },
      {
        "text": "I had the pleasure of working with Vraj at TCS, where he was an excellent full stack developer. He has deep knowledge of Java and Spring Boot, and his skills were crucial in our DGCA project. Vraj's experience with AWS services made our project run smoothly and efficiently. He is great at integrating different technologies and creating high-quality applications. Vraj is not only technically skilled but also a great team player. He is dedicated, solves problems quickly, and always goes the extra mile. His hard work and innovative ideas were a big asset to our team. I highly recommend Vraj for any role that requires expertise in Java, Spring Boot, and AWS. He will be a valuable addition to any team.",
        "user": "Manoj Shah, Senior Software Engineer at Cognizant"
      }
    ]
  }
}
